app/controllers/polls_controller.rb

  def increase
    @ti= Poll.find(params[:id])
    @ti.upvotes+=1
    @ti.save
---
SELECT  "polls".* FROM "polls"  WHERE "polls"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "polls" SET "updated_at" = ?, "upvotes" = ? WHERE "polls"."id" = 3  [["updated_at", "2014-10-27 17:36:13.558937"], ["upvotes", 1]]

  def decrease
   @ti= Poll.find(params[:id])
    @ti.downvotes+=1
    @ti.save
---
SELECT  "polls".* FROM "polls"  WHERE "polls"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "polls" SET "downvotes" = ?, "updated_at" = ? WHERE "polls"."id" = 3  [["downvotes", 1], ["updated_at", "2014-10-27 17:36:18.642159"]]

  def create
    @time = Time.now
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save
---
INSERT INTO "polls" ("created_at", "downvotes", "dtime", "issue", "updated_at", "upvotes") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-25 19:19:12.299183"], ["downvotes", 0], ["dtime", "2014-10-25 19:19:12.298932"], ["issue", ""], ["updated_at", "2014-10-25 19:19:12.299183"], ["upvotes", 0]]

  def destroy
    @poll.destroy
---
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]